BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega4809.PIC
        <edc:SFRDef edc:_addr="0x5E1" edc:access="----nnnn" edc:cname="CCLROUTEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LUT0" edc:desc="CCL LUT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT1" edc:desc="CCL LUT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT2" edc:desc="CCL LUT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LUT3" edc:desc="CCL LUT3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E2" edc:access="nnnnnnnn" edc:cname="USARTROUTEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="USART0" edc:desc="Port Multiplexer USART0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART0 on PA[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART0 on PA[7:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART1" edc:desc="Port Multiplexer USART1" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART1 on PC[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART1 on PC[7:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART2" edc:desc="Port Multiplexer USART2" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART2 on PF[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART2 on PF[5:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="USART3" edc:desc="Port Multiplexer USART3" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="USART3 on PB[3:0]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="USART3 on PB[5:4]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E3" edc:access="--nn--nn" edc:cname="TWISPIROUTEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI0" edc:desc="Port Multiplexer SPI0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="SPI0 on PA[7:4]" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="SPI0 on PC[3:0]" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="SPI0 on PE[3:0]" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TWI0" edc:desc="Port Multiplexer TWI0" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="SCL/SDA on PA[3:2], Slave mode on PC[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="SCL/SDA on PA[3:2], Slave mode on PF[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="SCL/SDA on PC[3:2], Slave mode on PF[3:2] in dual TWI mode" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Not connected to any pins" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E4" edc:access="-----nnn" edc:cname="TCAROUTEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TCA0" edc:desc="Port Multiplexer TCA0" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PORTA" edc:desc="TCA0 pins on PA[5:0]" edc:when="(field &amp; 0x7) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="PORTB" edc:desc="TCA0 pins on PB[5:0]" edc:when="(field &amp; 0x7) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="PORTC" edc:desc="TCA0 pins on PC[5:0]" edc:when="(field &amp; 0x7) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="PORTD" edc:desc="TCA0 pins on PD[5:0]" edc:when="(field &amp; 0x7) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="PORTE" edc:desc="TCA0 pins on PE[5:0]" edc:when="(field &amp; 0x7) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="PORTF" edc:desc="TCA0 pins on PF[5:0]" edc:when="(field &amp; 0x7) == 0x5"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x5E5" edc:access="----nnnn" edc:cname="TCBROUTEA" edc:nzwidth="0x8" ltx:memberofperipheral="PORTMUX">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TCB0" edc:desc="Port Multiplexer TCB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCB1" edc:desc="Port Multiplexer TCB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCB2" edc:desc="Port Multiplexer TCB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCB3" edc:desc="Port Multiplexer TCB3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x5E6" edc:offset="0x1A"/>
        <edc:SFRDef edc:_addr="0x600" edc:access="n----nnn" edc:cname="CTRLA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ADC Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREERUN" edc:desc="ADC Freerun mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESSEL" edc:desc="ADC Resolution" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit mode" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="8BIT" edc:desc="8-bit mode" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="RUNSTBY" edc:desc="Run standby mode" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x601" edc:access="-----nnn" edc:cname="CTRLB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SAMPNUM" edc:desc="Accumulation Samples" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="ACC1" edc:desc="1 ADC sample" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ACC2" edc:desc="Accumulate 2 samples" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ACC4" edc:desc="Accumulate 4 samples" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ACC8" edc:desc="Accumulate 8 samples" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ACC16" edc:desc="Accumulate 16 samples" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ACC32" edc:desc="Accumulate 32 samples" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ACC64" edc:desc="Accumulate 64 samples" edc:when="(field &amp; 0x7) == 0x06"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x602" edc:access="-nnn-nnn" edc:cname="CTRLC" edc:nzwidth="0x8" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRESC" edc:desc="Clock Pre-scaler" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER divided by 2" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_PER divided by 4" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_PER divided by 8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_PER divided by 16" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="CLK_PER divided by 32" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_PER divided by 64" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="CLK_PER divided by 128" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_PER divided by 256" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal reference" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VDDREF" edc:desc="VDD" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VREFA" edc:desc="External reference" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SAMPCAP" edc:desc="Sample Capacitance Selection" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x603" edc:access="nnnnnnnn" edc:cname="CTRLD" edc:nzwidth="0x8" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SAMPDLY" edc:desc="Sampling Delay Selection" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="ASDV" edc:desc="Automatic Sampling Delay Variation" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="ASVOFF" edc:desc="The Automatic Sampling Delay Variation is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="ASVON" edc:desc="The Automatic Sampling Delay Variation is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="INITDLY" edc:desc="Initial Delay Selection" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="DLY0" edc:desc="Delay 0 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DLY16" edc:desc="Delay 16 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DLY32" edc:desc="Delay 32 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DLY64" edc:desc="Delay 64 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DLY128" edc:desc="Delay 128 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="DLY256" edc:desc="Delay 256 CLK_ADC cycles" edc:when="(field &amp; 0x7) == 0x05"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x604" edc:access="-----nnn" edc:cname="CTRLE" edc:nzwidth="0x8" ltx:memberofperipheral="ADC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WINCM" edc:desc="Window Comparator Mode" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Window Comparison" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Below Window" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Above Window" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Inside Window" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="OUTSIDE" edc:desc="Outside Window" edc:when="(field &amp; 0x7) == 0x04"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
